IDEA StatiCa Open Model
OpenModel.GetMaxId Method (Type)
Compatible with IDEA StatiCa Beta 21.0 - beta
 Get max Id value for specified type
 Namespace: IdeaRS.OpenModel
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public int GetMaxId(
	Type t
)
Public Function GetMaxId (
	t As Type
) As Integer
public:
int GetMaxId(
	Type^ t
)
Parameters
t
Type: System.Type
Type
Return Value
Type: Int32
Max Id value or zero if don't any exists
See Also
Reference
OpenModel Class
GetMaxId Overload
IdeaRS.OpenModel Namespace